eda_main_dash.org
#+options: html-style:nil f:nil toc:nil num:t
#+options: html-postamble:nil
#+html_head: <meta name="viewport" content="width=device-width, initial-scale=1">
#+html_head: <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/water.css@2/out/light.css">
#+startup: indent
#+startup: overview
#+title:  Generative model of LoRa WAN
#+author: ZSR
#+date:   \today

* Python headers                                                   :noexport:

#+begin_src python :eval never-export
import numpy as np
import pandas as pd

#+end_src

#+begin_src python :eval never :tangle Introduction.py
import streamlit as st


st.set_page_config(page_title="LoRaWAN EDA", layout="centered")
#+end_src

#+begin_src python :eval never :tangle pages/1_Motivation.py
import streamlit as st


#+end_src

#+begin_src python :eval never :tangle pages/2_The_dataset.py
import streamlit as st

import streamlit as st
import pandas as pd
import matplotlib.pyplot as plt
import plotly.express as px
import numpy as np


import plotly.graph_objects as go
from plotly.subplots import make_subplots

from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import FunctionTransformer, LabelEncoder, RobustScaler

#+end_src

#+begin_src python :eval never :tangle pages/3_Feature_selection.py
import streamlit as st


#+end_src

#+begin_src python :eval never :tangle pages/4_Selected_features.py
import streamlit as st
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

#+end_src

* Introduction

*Cybersecurity Digital Twins and LoRaWAN in the context of Smart-Cities*.

Cybersecurity Digital Twins (CSDTs) are digital representations of connected systems that combine information about assets, configurations, dependencies, and possible attack paths. In the context of the [[https://www.mirandaproject.eu/][MIRANDA project]], a CSDT is used to model the security posture of complex, heterogeneous, and multi-ownership ICT systems, so that operators can analyse risks, anticipate threats, and support detection and response in a proactive but non-invasive way.

CSDTs are particularly important in smart cities because urban services rely on many interconnected platforms, devices, and providers, often organised as evolving digital service chains. In such settings, limited visibility across organisational boundaries can make attacks harder to detect and contain, which makes a shared and adaptive security view especially valuable.

LPWAN stands for /Low-Power Wide-Area Network/. It refers to wireless technologies designed to connect devices over long distances while keeping energy consumption low. [[https://lora-alliance.org/about-lorawan/][LoRaWAN]] is an open LPWAN protocol for IoT systems that supports bidirectional communication, end-to-end security, mobility, and localisation services over the LoRa physical layer.

In this setting, LoRaWAN fits at the edge of the smart-city infrastructure, where sensors and actuators collect data from streets, buildings, transport systems, as well as utilities, and forward it to gateways and other services. It therefore forms part of the broader digital service chain that should be observed and protected.

Here, security can be improved by adding a first layer of defence based on the physical aspects of communication, such as RSSI, SNR, ADR, etc.. These features do not replace other protection mechanism. Instead, they add early context for anomaly detection, device verification, and location-consistency checks, which can help reveal suspicious behaviour before it affects other layers of the system.

#+begin_src python :eval never :tangle Introduction.py
st.image("assets/smart_city_baner.png")

motivation = """
### Cybersecurity Digital Twins and LoRaWAN in the context of Smart-Cities ... 

Cybersecurity Digital Twins (CSDTs) are digital representations of connected systems that combine information about assets, configurations, dependencies, and possible attack paths. In the context of the [MIRANDA project](https://www.mirandaproject.eu/), a CSDT is used to model the security posture of complex, heterogeneous, and multi-ownership ICT systems, so that operators can analyse risks, anticipate threats, and support detection and response in a proactive but non-invasive way.

CSDTs are particularly important in smart cities because urban services rely on many interconnected platforms, devices, and providers, often organised as evolving digital service chains. In such settings, limited visibility across organisational boundaries can make attacks harder to detect and contain, which makes a shared and adaptive security view especially valuable.

LPWAN stands for _Low-Power Wide-Area Network_. It refers to wireless technologies designed to connect devices over long distances while keeping energy consumption low. [LoRaWAN](https://lora-alliance.org/about-lorawan/) is an open LPWAN protocol for IoT systems that supports bidirectional communication, end-to-end security, mobility, and localisation services over the LoRa physical layer.

In this setting, LoRaWAN fits at the edge of the smart-city infrastructure, where sensors and actuators collect data from streets, buildings, transport systems, as well as utilities, and forward it to gateways and other services. It therefore forms part of the broader digital service chain that should be observed and protected.

Here, security can be improved by adding a first layer of defence based on the physical aspects of communication, such as RSSI, SNR, ADR, etc.. These features do not replace other protection mechanism. Instead, they add early context for anomaly detection, device verification, and location-consistency checks, which can help reveal suspicious behaviour before it affects other layers of the system.

"""

st.markdown(motivation)
#+end_src

