eda_main_dash.html
<div id="outline-container-orgdb1808c" class="outline-2">
<h2 id="orgdb1808c"><span class="section-number-2">2.</span> Motivation</h2>
<div class="outline-text-2" id="text-2">
<p>
Probabilistic modelling of network traffic can support both anomaly detection and synthetic data generation. Such models can help to identify transmissions that deviate from expected behaviour, while also generating realistic samples for testing monitoring and  components analysis.
</p>

<p>
This document presents an exploratory data analysis of the Medellin LoRaWAN dataset and an initial feature-engineering stage, as a preliminary step towards a complete modelling pipeline. The main focus is to refine problem representation.
</p>

<p>
The dataset provides a strong basis for our work because as it was collected over four months in a real urban LoRaWAN deployment. The available variables describe several aspects of communication, including timing and device information, geometric and link-budget parameters, transmission settings, environmental conditions, and channel indicators such as RSSI, SNR, and time on air. There are also other features of this dataset, that are important for us, that will be discussed in following sections.
</p>

<ul class="org-ul">
<li>We go for ML approach &ndash; easy to maintain, flexible, expertise accessible to maintainers.</li>
<li>It is a better approach than complex network simulations [cite lora sim. tools].</li>
<li>Add illustration of ML.</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><code>st.image(<span style="color: #98be65;">"assets/lora_dark.svg"</span>)

<span style="color: #dcaeea;">description</span> <span style="color: #51afef;">=</span> <span style="color: #98be65;">"""
### Motivation.

Probabilistic modelling of network traffic can support both anomaly detection and synthetic data generation. Such models can help to identify transmissions that deviate from expected behaviour, while also generating realistic samples for testing monitoring and  components analysis.

This document presents an exploratory data analysis of the Medellin LoRaWAN dataset and an initial feature-engineering stage, as a preliminary step towards a complete modelling pipeline. The main focus is to refine problem representation.

The dataset provides a strong basis for our work because as it was collected over four months in a real urban LoRaWAN deployment. The available variables describe several aspects of communication, including timing and device information, geometric and link-budget parameters, transmission settings, environmental conditions, and channel indicators such as RSSI, SNR, and time on air. There are also other features of this dataset, that are important for us, that will be discussed in following sections.



"""</span>

st.markdown(description)


<span style="color: #dcaeea;">col1</span>, <span style="color: #dcaeea;">col2</span>, <span style="color: #dcaeea;">col3</span> <span style="color: #51afef;">=</span> st.columns([1,2,1])
<span style="color: #51afef;">with</span> col2:
    st.image(<span style="color: #98be65;">"assets/anomaly_dark.svg"</span>, width<span style="color: #51afef;">=</span>500)

</code></pre>
</div>
</div>
</div>
