eda_main_dash.html
<div id="outline-container-org8ca5014" class="outline-2">
<h2 id="org8ca5014"><span class="section-number-2">3.</span> The dataset</h2>
<div class="outline-text-2" id="text-3">
<p>
In our studies we are using <a href="https://www.mdpi.com/2306-5729/8/1/4">Medellin</a> in Chile &ndash; published at <a href="https://github.com/magonzalezudem/MDPI_LoRaWAN_Dataset_With_Environmental_Variables">GitHub</a>. As with any machine-learning system, model quality is limited by the quality, coverage, and structure of the underlying data. Although the Medellín dataset contains measurements from only four devices, this is precisely what makes it a useful cybersecurity case study. It captures a small, well-characterised LoRaWAN deployment over four months in a real urban setting, together with an unusually rich set of environmental, link-budget, and channel variables. This provides detailed visibility into a realistic maintenance scenario, where some latent factors, such as device configuration, placement, and local shadowing, are only weakly randomised, while other factors, including environmental conditions, are well sampled over time. In modelling terms, this creates a setting in which irreducible variability in the observations coexists with uncertainty caused by limited coverage of devices and configurations, that is, a combination of aleatoric and epistemic uncertainty.
</p>


<p>
This dataset contains <b>990,750 LoRaWAN transmission records</b> collected from multiple End‑Nodes (EN) communicating with a Gateway (GW). Each row corresponds to a single transmission with physical, environmental, and link‑quality measurements.
</p>
</div>
</div>
