eda_main_dash.html
<div id="outline-container-org57b8614" class="outline-2">
<h2 id="org57b8614"><span class="section-number-2">4.</span> Overview of features</h2>
<div class="outline-text-2" id="text-4">
<p>
In this section we focus on feature selection and engineering,  i.e. what we will include the final training set, what will be modified, and what can be dropped. In other words, we need to decide what will count as a representation of the network state, or at least of those aspects of the state that matter for detection. By network state, we mean an abstraction of the available data that allows us to distinguish legitimate traffic from anomalies.
</p>

<p>
Here, we focus on the physical and hardware aspects of communication, so the state may be taken as a function of frame and gateway metadata, such as RSSI, SNR, frequency, or spreading factor. However, bare in mind that within MIRANDA and development of cyber-security digital twins this is only part of the challenge. The idea is that, if an impostor joins the network, the new device, being in an unusual location, may leave an unusual signature in the relation between the features we choose to include &ndash; for example between declared coordinates and received signal strength. In LoRaWAN, many of these features are encoded in the metadata attached to transmissions, so the designer has plenty of freedom in choosing what aspect of the network will be modified.
</p>

<p>
The goal here is in some sense optimal selection. We probably want to avoid redundant features or ones that will rarely available in the context of a CS digital twin. In other words, we need a sufficient minimal representation of the network state (sentence to improve).
</p>

<p>
<b>Features related to propagation</b>
</p>

<p>
The current dataset is useful in this respect because it provides a rich set of timing, link-budget, environmental, and channel variables from a real deployment, which gives us many possible starting points for a representative model. At the same time, we should stay with quantities that are commonly used in practice. For example, quantities such as RSSI and SNR should be included explicitly, while some environmental conditions, such as humidity, are better treated implicitly, through uncertainty (unless they are part of the deployed system). A sensible way to approach this challenge is to start with key property that will pull, in some sense, all the features we need, which also we can later augment.
</p>

<p>
We start with the assertion, that simplest useful digital twin will have certain ability to predict network modifications. The most straightforward way to do it, is to expand it by adding another end device, of known hardware, at a new location. Therefore distance must enter the state description, together with RSSI. By definition,
</p>

<p>
\[
\mathrm{SNR} = \mathrm{RSSI} - P_n,
\]
</p>

<p>
where \[P_n\] is the noise power. Therefore, by including also SNR we will improve our representation. For readers that are more ML focused, we remind that we are working here in logarithmic scales so rations proportions are represented by differences and sums. Let us investigate this through a propagation model. A standard choice is the log-distance path-loss model,
</p>

<p>
\[
\def \PL {\mathrm{PL}}
\PL(d) = \PL(d_0) + 10 n \log_{10} \left( \frac{d}{d_0} \right) + X_\sigma,
\]
</p>

<p>
where \(\mathrm{PL}(d_0)\) is the path loss at a reference distance \[d_0\], \[n\] is the path-loss exponent, \(d\) is the distance between transmitter and receiver, and \[X_\sigma\] is a shadowing term, often \(X_\sigma \sim \mathcal{N}(0, \sigma)\). So it seems that this segment of features is complete. We will expand on in a moment. First, we introduce the first element of feature engineering.
</p>

<p>
<b>Feature engineering.</b>
</p>

<p>
It follows that the most convenient way to represent distance is on a logarithmic scale. This is consistent with the propagation models introduced above. Also, when we later derive the expected path loss, it may be more convenient, at least for prediction, to work with expected or estimated noise power rather than with SNR itself. In the context of this research, most of the features is in optimal representations simple because industry standards are already optimised for clarity and simplicity. For example, SNR and RSSI are almost always given in dB or dBm units.
</p>

<p>
<b>Contextual parameter &ndash; propagation</b>
</p>

<p>
Will other features matter as well? Let us consider the more advanced urban Okumura&ndash;Hata model
</p>

<p>
\[
\mathrm{PL}(\ldots) = A + B \log_{10}(f_c) - C \log_{10}(h_b) - a(h_m) + \left(D - E \log_{10}(h_b)\right)\log_{10}(d),
\]
</p>

<p>
where \[f_c\] is the carrier frequency, \[h_b\] is the base-station antenna height, and \[h_m\] is the end-device antenna height. The correction term \[a(h_m)\] accounts for the receiver antenna height and, in practice, depends on the urban setting. Capital letters represent to be estimated. In qualitative terms, the model says that path loss grows with distance and frequency, while higher antennas placements reduces it.
</p>

<p>
These quantities are important considerations. It would therefore be tempting to include all of these parameters in the dataset. However, such information is not usually available. Universal generative model for LoRaWAN logs should be confined to carefully crafted set of features that ensures the model remains transferable across deployments (while still capturing the essential information necessary for robust testing and anomaly detection). It is therefore better to treat it as a bias term in the path loss, and as one source of epistemic uncertainty.
</p>

<p>
Frequency, on the other hand, appears in the model and is often reported. One could argue that, because the adaptive range is narrow, its main effect is again a bias term. Should it then be included explicitely? On the ground of satisfying propagation model, probably not, at least not in the context of this dataset. On the other hand, there are other important considerations.
</p>

<p>
Even in the absence of a full time-series model for frequency, the marginal distribution of channel occupancy may capture features of the local radio environment, offering a potentially useful signal fingerprinting. For instance, when channel activity detection (CAD) and adaptive channel masking are enabled, the empirical under utilisation of specific frequnecies can serve as an indicator of protocol compliance, helping to distinguish between legitimate and anomalous nodes.
</p>

<p>
<b>ADR policy, link budget, payload and data-rate</b>
</p>

<p>
We can apply a very similar reasoning to other features as well. One of the key parameters governing the efficiency and robustness of a LoRa link is the spreading factor (SF).
</p>

<p>
When ADR is enabled, the network may adapt the spreading factor on the basis of recent link-quality measurements, typically using an SNR-derived margin over recent uplinks. In that sense, SF may contribute to a radio or location fingerprint, although it is not its deterministic identifier. An attempt to impersonate a legitimate device from a different location may induce an anomalous tuple (SF, SNR, RSSI), particularly when the legitimate device operates under stable conditions.
</p>

<p>
Other factors related to propagation affecting transmission quality, such as antenna gains and environmental conditions, are often unavailable in operational datasets. In the absence of explicit measurements, these factors may be absorbed into latent terms affecting the bias and variance of the observable radio metrics, in the same manner as was previously done for parameters such as antenna height.
</p>

<p>
The next consideration concerns the characterisation of the payload. While the analysis of payload content belongs to other layers of the digital twin, payload size may itself constitute an informative feature for anomaly detection.
</p>

<p>
Likewise, quantities related to the data rate may also be relevant. The nominal LoRa physical-layer bit rate is given by
\[
\text{R}_b = \text{SF} \left( \frac{4}{4 + \text{CR}} \right)\frac{\text{BW} \times 10^3}{2^{\text{SF}}},
\]
where \(\text{R}_b\) denotes the nominal LoRa data rate in \(\text{b} \, \text{s}^{-1}\), \(\text{SF}\) is the spreading factor, \(\text{CR} \in \{1,2,3,4\}\) is the coding-rate parameter, and \(\text{BW}\) is the signal bandwidth expressed in kHz. The factor \(10^3\) converts the bandwidth from kHz to Hz so that \(\text{R}_b\) is obtained in bits per second. Equivalently, the term \(\text{BW}/2^{\text{SF}}\) represents the symbol rate, while \(4/(4 + \text{CR})\) accounts for the reduction in effective information rate due to forward error correction.
</p>

<p>
These parameters, when considered together with time-on-air (ToA), may provide a coarse surrogate for payload-related behaviour when frame length is unavailable. However, their more direct value lies in checking consistency with the configured data-rate profile, bandwidth selection, and ADR behaviour of the network. Therefore, whenever available, these variables should also be included in the feature set.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Feature</td>
<td class="org-left">Symbol</td>
<td class="org-left">Description</td>
</tr>

<tr>
<td class="org-left">--------------</td>
<td class="org-left">--------------&ndash;&mdash;:</td>
<td class="org-left">---------------------------------------------------------------------------------------------------</td>
</tr>

<tr>
<td class="org-left"><code>timestamp</code></td>
<td class="org-left">\(t\)</td>
<td class="org-left">Measurement time (used for temporal context/splitting and drift).</td>
</tr>

<tr>
<td class="org-left"><code>device_id</code></td>
<td class="org-left">\(\mathrm{id}\)</td>
<td class="org-left">End-node identifier (captures per-device fingerprints and fixed deployment differences).</td>
</tr>

<tr>
<td class="org-left"><code>distance</code></td>
<td class="org-left">\(d\)</td>
<td class="org-left">EN–GW separation in metres (primary geometric driver of propagation/path loss).</td>
</tr>

<tr>
<td class="org-left"><code>frequency</code></td>
<td class="org-left">\(f\)</td>
<td class="org-left">Carrier frequency (contextual PHY parameter; can shift propagation and channel conditions).</td>
</tr>

<tr>
<td class="org-left"><code>frame_length</code></td>
<td class="org-left">\(l_{\text{frame}}\)</td>
<td class="org-left">Payload size in bytes (behaviour/policy proxy without inspecting payload content).</td>
</tr>

<tr>
<td class="org-left"><code>rssi</code></td>
<td class="org-left">\(\mathrm{RSSI}\)</td>
<td class="org-left">Received signal strength at the gateway in dBm (core observable of link power).</td>
</tr>

<tr>
<td class="org-left"><code>snr</code></td>
<td class="org-left">\(\mathrm{SNR}\)</td>
<td class="org-left">Signal-to-noise ratio in dB (core observable of channel quality).</td>
</tr>

<tr>
<td class="org-left"><code>toa</code></td>
<td class="org-left">\(\mathrm{ToA}\)</td>
<td class="org-left">Time-on-air in seconds (captures airtime regime and potential policy violations).</td>
</tr>

<tr>
<td class="org-left"><code>sf</code></td>
<td class="org-left">\(\mathrm{SF}\)</td>
<td class="org-left">Spreading factor (ADR-relevant parameter; relates to coverage/airtime trade-offs and fingerprints).</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-python"><code>
st.set_page_config(
    page_title<span style="color: #51afef;">=</span><span style="color: #98be65;">"Feature selection"</span>,
    layout<span style="color: #51afef;">=</span><span style="color: #98be65;">"centered"</span>,
)

st.title(<span style="color: #98be65;">"Feature selection"</span>)

st.markdown(r<span style="color: #98be65;">'''

- ```TODO``` improve justification for propagation parameters by addressing dependance on frequency as soon as we introduce the propagation model

### The rationale

In this section we focus on feature selection and engineering,  i.e. what we will include in the final training set, what will be modified, and what can be dropped. In other words, we need to decide what will count as a representation of the network state, or at least of those aspects of the state that matter for detection. By network state, we mean an abstraction of the available data that allows us to distinguish legitimate traffic from anomalies.


**The paradgim**

Here, we focus on the physical and hardware aspects of communication, so the state may be taken as a function of frame and gateway metadata, such as RSSI, SNR, frequency, or spreading factor. However, bare in mind that within MIRANDA and development of cyber-security digital twins this is only part of the challenge. The idea is that, if an impostor joins the network, the new device, being in an unusual location, may leave an unusual signature in the relation between the features we choose to include -- for example between declared coordinates and received signal strength. In LoRaWAN, many of these features are encoded in the metadata attached to transmissions, so the designer has plenty of freedom in choosing what aspect of the network will be modified.


**The strategy**

The current dataset is useful in this respect because it provides a rich set of timing, link-budget, environmental, and channel variables from a real deployment, which gives us many possible starting points for a representative model. At the same time, we should stay with quantities that are commonly used in practice. For example, quantities such as RSSI and SNR should be included explicitly, while some environmental conditions, such as humidity, are better treated implicitly, through uncertainty (unless they are part of the deployed system). A sensible way to approach this challenge is to start with key property that will pull, in some sense, all the features we need, which also we can later augment.


**Features related to propagation**

We start with the assertion, that simplest useful digital twin will have certain ability to predict network modifications. The most straightforward way to do it, is to expand it by adding another end device, of known hardware, at a new location. Therefore distance must enter the state description, together with RSSI. By definition,
$$
\mathrm{SNR} = \mathrm{RSSI} - P_n,
$$
where $$P_n$$ is the noise power. Therefore, by including also SNR we will improve our representation. For readers that are more ML focused, we remind that we are working here in logarithmic scales so rations proportions are represented by differences and sums.

Will other features matter as well? Let us investigate this through a propagation model. A standard choice is the log-distance path-loss model,
$$
\def \PL {\mathrm{PL}}
\PL(d) = \PL(d_0) + 10 n \log_{10} \left( \frac{d}{d_0} \right) + X_\sigma,
$$
where $\mathrm{PL}(d_0)$ is the path loss at a reference distance $$d_0$$, $$n$$ is the path-loss exponent, $d$ is the distance between transmitter and receiver, and $$X_\sigma$$ is a shadowing term, often $X_\sigma \sim \mathcal{N}(0, \sigma)$. So it seems that this segment of features is complete. We will expand on this later.


**Feature engineering.**

It follows that the most convenient way to represent distance is on a logarithmic scale. This is consistent with the propagation models introduced above. Also, when we later derive the expected path loss, it may be more convenient, at least for prediction, to work with expected or estimated noise power rather than with SNR itself. In the context of this research, most of the features is in optimal representations simple because industry standards are already optimised for clarity and simplicity. For example, SNR and RSSI are almost always given in dB or dBm units.

**Contextual parameters**

Will other features matter as well? Let us consider the more advanced urban Okumura--Hata model

$$
\mathrm{PL}(\ldots) = A + B \log_{10}(f_c) - C \log_{10}(h_b) - a(h_m) + \left(D - E \log_{10}(h_b)\right)\log_{10}(d),
$$

where $$f_c$$ is the carrier frequency, $$h_b$$ is the base-station antenna height, and $$h_m$$ is the end-device antenna height. The correction term $$a(h_m)$$ accounts for the receiver antenna height and, in practice, depends on the urban setting. Capital letters represent to be estimated. In qualitative terms, the model says that path loss grows with distance and frequency, while higher antennas placements reduces it.

These are important considerations. It would therefore be tempting to include these parameters in the dataset.

However, such information is not usually available as part of the metadata. It is therefore better to treat it as a bias term in the path loss, and as one source of epistemic uncertainty. Frequency, on the other hand, appears in the model and is often reported. One could argue that, because the adaptive range is narrow, its main effect is again a bias term. Should it then be included? On the ground of satisfying propagation model, probably not, at least not in the context of this dataset. However, there are other reasons to include this aspect of communication.

**ADR policy and other features**

We can apply a very similar reasoning to other features as well. One of the key parameters defining the efficiency of a LoRa link is the spreading factor (SF). When adaptive data rate (ADR) is enabled, SF is usually adjusted according to the recent history of SNR, and as such, can be part of the location fingerprint. Any attempt to spoof a legitimate device and to communicate from another location, might result in anomalous relationship between SF, SNR and RSSI. 

With regard to other features related to transmission quality, such as detailed link-budget components (for example, transmission power and antenna gains) and environmental conditions, these are also typically unavailable. Accordingly, they should be treated as latent factors affecting the bias and variance of the observable radio metrics, in the same manner as was previously done for parameters such as antenna height.

The next consideration is related to the characterisation of the payload. While the analysis of its content belong to other layers of the digital twin, its volume might be an important feature allowing to detect anomalies.

Subsequently, quantities related to the data rate are also very relevant. The data rate is given by
$$
\text{R}_b = \text{SF} \left( \frac{4}{4 + \text{CR}} \right)\frac{\text{BW} \times 10^3}{2^{\text{SF}}},
$$

where $\text{R}_b$ denotes the nominal LoRa data rate in bit s$^{-1}$, $\text{SF}$ is the spreading factor, $\text{CR} \in \{1,2,3,4\}$ is the coding-rate parameter, and $\text{BW}$ is the signal bandwidth expressed in kHz. The factor $10^3$ converts the bandwidth from kHz to Hz so that $\text{R}_b$ is obtained in bits per second. Equivalently, the term $\text{BW}/2^{\text{SF}}$ represents the symbol rate, while $4/(4 + \text{CR})$ accounts for the reduction in effective information rate due to forward error correction.

While these parameters combined with time-on-air (ToA) provide indication of the payload, more importantly they also provide some level of verification if link adheres to the network policies. Therefore, if available they should also be a part of the feature set.

### Final training set (QoI)

Based on these considerations, we selected the following set of features.

| Feature        |               Symbol | Description                                                                                         |
| -------------- | -------------------: | --------------------------------------------------------------------------------------------------- |
| `timestamp`    |                $$t$$ | Measurement time (used for temporal context/splitting and drift).                                   |
| `device_id`    |      $$\mathrm{id}$$ | End-node identifier (captures per-device fingerprints and fixed deployment differences).            |
| `distance`     |                $$d$$ | EN&#8211;GW separation in metres (primary geometric driver of propagation/path loss).                     |
| `frequency`    |                $$f$$ | Carrier frequency (contextual PHY parameter; can shift propagation and channel conditions).         |
| `frame_length` | $$l_{\text{frame}}$$ | Payload size in bytes (behaviour/policy proxy without inspecting payload content).                  |
| `rssi`         |    $$\mathrm{RSSI}$$ | Received signal strength at the gateway in dBm (core observable of link power).                     |
| `snr`          |     $$\mathrm{SNR}$$ | Signal-to-noise ratio in dB (core observable of channel quality).                                   |
| `toa`          |     $$\mathrm{ToA}$$ | Time-on-air in seconds (captures airtime regime and potential policy violations).                   |
| `sf`           |      $$\mathrm{SF}$$ | Spreading factor (ADR-relevant parameter; relates to coverage/airtime trade-offs and fingerprints). |


'''</span>)

</code></pre>
</div>
</div>
</div>
