eda_main_dash.html
<div id="outline-container-org496224e" class="outline-2">
<h2 id="org496224e"><span class="section-number-2">5.</span> The dataset</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Here, we show the data set</li>
</ul>


<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #51afef;">import</span> numpy <span style="color: #51afef;">as</span> np
<span style="color: #51afef;">import</span> pandas <span style="color: #51afef;">as</span> pd
<span style="color: #51afef;">import</span> plotly.graph_objects <span style="color: #51afef;">as</span> go
<span style="color: #51afef;">import</span> plotly.express <span style="color: #51afef;">as</span> px
<span style="color: #51afef;">import</span> streamlit <span style="color: #51afef;">as</span> st
<span style="color: #51afef;">from</span> plotly.subplots <span style="color: #51afef;">import</span> make_subplots
<span style="color: #51afef;">import</span> plotly.express <span style="color: #51afef;">as</span> px


</code></pre>
</div>


<div class="org-src-container">
<pre class="src src-python"><code>
st.set_page_config(
    page_title<span style="color: #51afef;">=</span><span style="color: #98be65;">"The dataset"</span>,
    layout<span style="color: #51afef;">=</span><span style="color: #98be65;">"centered"</span>,
)

st.title(<span style="color: #98be65;">"The dataset"</span>)

</code></pre>
</div>


<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #5B6268;"># </span><span style="color: #5B6268;">pages/4_Selected_features.py
</span>
st.set_page_config(layout<span style="color: #51afef;">=</span><span style="color: #98be65;">"centered"</span>)

st.markdown(
    <span style="color: #98be65;">"""
    &lt;style&gt;
    .block-container {
        max-width: 1000px;
        padding-left: 2rem;
        padding-right: 2rem;
    }
    &lt;/style&gt;
    """</span>,
    unsafe_allow_html<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>,
)

st.title(<span style="color: #98be65;">"The dataset"</span>)
</code></pre>
</div>


<div class="org-src-container">
<pre class="src src-python"><code>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Data
</span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">====
</span>
<span style="color: #dcaeea;">data</span> <span style="color: #51afef;">=</span> pd.read_csv(
    <span style="color: #98be65;">"LoRaWAN Path Loss Measurement Campaign No Outliers V2.csv"</span>,
    index_col<span style="color: #51afef;">=</span>0,
)
<span style="color: #dcaeea;">data</span> <span style="color: #51afef;">=</span> data.drop_duplicates().replace([np.inf, <span style="color: #51afef;">-</span>np.inf], np.nan)

<span style="color: #dcaeea;">qoi</span> <span style="color: #51afef;">=</span> [<span style="color: #98be65;">"timestamp"</span>, <span style="color: #98be65;">"device_id"</span>, <span style="color: #98be65;">"distance"</span>, <span style="color: #98be65;">"frequency"</span>, <span style="color: #98be65;">"frame_length"</span>, <span style="color: #98be65;">"rssi"</span>, <span style="color: #98be65;">"snr"</span>, <span style="color: #98be65;">"toa"</span>, <span style="color: #98be65;">"sf"</span>]
<span style="color: #dcaeea;">df</span> <span style="color: #51afef;">=</span> data.sample(10_000, random_state<span style="color: #51afef;">=</span>42).loc[:, qoi]

<span style="color: #dcaeea;">numeric_cols</span> <span style="color: #51afef;">=</span> df.select_dtypes(include<span style="color: #51afef;">=</span>[np.number]).columns.tolist()
<span style="color: #dcaeea;">GROUP_COL</span> <span style="color: #51afef;">=</span> <span style="color: #98be65;">"device_id"</span>
<span style="color: #dcaeea;">order_by</span> <span style="color: #51afef;">=</span> <span style="color: #98be65;">"alphabetical"</span>

</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><code>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Sidebar &#8212; ONLY continuous tuning controls
</span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">=========================================
</span><span style="color: #51afef;">with</span> st.sidebar:
    st.header(<span style="color: #98be65;">"Plot tuning"</span>)

    <span style="color: #dcaeea;">value_col</span> <span style="color: #51afef;">=</span> st.selectbox(
    <span style="color: #98be65;">"Feature"</span>,
    numeric_cols,
    index<span style="color: #51afef;">=</span>numeric_cols.index(<span style="color: #98be65;">"rssi"</span>) <span style="color: #51afef;">if</span> <span style="color: #98be65;">"rssi"</span> <span style="color: #51afef;">in</span> numeric_cols <span style="color: #51afef;">else</span> 0,
    )
    
    <span style="color: #dcaeea;">max_points</span> <span style="color: #51afef;">=</span> st.slider(
        <span style="color: #98be65;">"Max points per device (for KDE + rain)"</span>,
        50, 1500, 500, 50,
    )

    <span style="color: #dcaeea;">x_spread</span> <span style="color: #51afef;">=</span> st.slider(
        <span style="color: #98be65;">"Rain X-axis spread"</span>,
        0.01, 0.20, 0.05, 0.01,
        <span style="color: #c678dd;">help</span><span style="color: #51afef;">=</span><span style="color: #98be65;">"Horizontal dispersion of sampled points (kept non-overlapping)"</span>,
    )

    <span style="color: #dcaeea;">fig_height</span> <span style="color: #51afef;">=</span> st.slider(
        <span style="color: #98be65;">"Figure height"</span>,
        500, 1100, 720, 20,
    )

</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><code>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Utilities
</span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">=========
</span>
<span style="color: #51afef;">def</span> <span style="color: #c678dd;">to_rgba</span>(color: <span style="color: #c678dd;">str</span>, alpha: <span style="color: #c678dd;">float</span>) <span style="color: #51afef;">-&gt;</span> <span style="color: #c678dd;">str</span>:
    <span style="color: #51afef;">if</span> color.startswith(<span style="color: #98be65;">"rgb"</span>):
        <span style="color: #51afef;">return</span> color.replace(<span style="color: #98be65;">"rgb"</span>, <span style="color: #98be65;">"rgba"</span>).replace(<span style="color: #98be65;">")"</span>, f<span style="color: #98be65;">", </span>{alpha}<span style="color: #98be65;">)"</span>)
    <span style="color: #dcaeea;">c</span> <span style="color: #51afef;">=</span> color.lstrip(<span style="color: #98be65;">"#"</span>)
    <span style="color: #dcaeea;">r</span>, <span style="color: #dcaeea;">g</span>, <span style="color: #dcaeea;">b</span> <span style="color: #51afef;">=</span> <span style="color: #c678dd;">int</span>(c[0:2], 16), <span style="color: #c678dd;">int</span>(c[2:4], 16), <span style="color: #c678dd;">int</span>(c[4:6], 16)
    <span style="color: #51afef;">return</span> f<span style="color: #98be65;">"rgba(</span>{r}<span style="color: #98be65;">,</span>{g}<span style="color: #98be65;">,</span>{b}<span style="color: #98be65;">,</span>{alpha}<span style="color: #98be65;">)"</span>


<span style="color: #51afef;">def</span> <span style="color: #c678dd;">downsample</span>(x: np.ndarray, max_n: <span style="color: #c678dd;">int</span>, rng: np.random.Generator) <span style="color: #51afef;">-&gt;</span> np.ndarray:
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">len</span>(x) <span style="color: #51afef;">&lt;=</span> max_n:
        <span style="color: #51afef;">return</span> x
    <span style="color: #51afef;">return</span> x[rng.choice(<span style="color: #c678dd;">len</span>(x), size<span style="color: #51afef;">=</span>max_n, replace<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>)]

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">build_color_map</span>(df, color_col):
    <span style="color: #dcaeea;">palette</span> <span style="color: #51afef;">=</span> px.colors.qualitative.Plotly
    <span style="color: #dcaeea;">uniq</span> <span style="color: #51afef;">=</span> <span style="color: #c678dd;">sorted</span>(df[color_col].dropna().unique())
    <span style="color: #51afef;">return</span> {u: palette[i <span style="color: #51afef;">%</span> <span style="color: #c678dd;">len</span>(palette)] <span style="color: #51afef;">for</span> i, u <span style="color: #51afef;">in</span> <span style="color: #c678dd;">enumerate</span>(uniq)}

</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><code>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Plotting functions
</span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">==================
</span>
<span style="color: #51afef;">def</span> <span style="color: #c678dd;">raincloud_plot</span>(df: pd.DataFrame) <span style="color: #51afef;">-&gt;</span> go.Figure:

    <span style="color: #dcaeea;">plot_df</span> <span style="color: #51afef;">=</span> df[[GROUP_COL, value_col]].dropna()
    <span style="color: #dcaeea;">grouped</span> <span style="color: #51afef;">=</span> plot_df.groupby(GROUP_COL)[value_col]

    <span style="color: #51afef;">if</span> order_by <span style="color: #51afef;">==</span> <span style="color: #98be65;">"median"</span>:
        <span style="color: #dcaeea;">devices</span> <span style="color: #51afef;">=</span> grouped.median().sort_values().index.tolist()
    <span style="color: #51afef;">elif</span> order_by <span style="color: #51afef;">==</span> <span style="color: #98be65;">"mean"</span>:
        <span style="color: #dcaeea;">devices</span> <span style="color: #51afef;">=</span> grouped.mean().sort_values().index.tolist()
    <span style="color: #51afef;">else</span>:
        <span style="color: #dcaeea;">devices</span> <span style="color: #51afef;">=</span> <span style="color: #c678dd;">sorted</span>(plot_df[GROUP_COL].astype(<span style="color: #c678dd;">str</span>).unique())

    <span style="color: #dcaeea;">xs</span> <span style="color: #51afef;">=</span> np.arange(<span style="color: #c678dd;">len</span>(devices), dtype<span style="color: #51afef;">=</span><span style="color: #c678dd;">float</span>)
    <span style="color: #dcaeea;">x_map</span> <span style="color: #51afef;">=</span> <span style="color: #c678dd;">dict</span>(<span style="color: #c678dd;">zip</span>(devices, xs))

    <span style="color: #dcaeea;">palette</span> <span style="color: #51afef;">=</span> px.colors.qualitative.Safe
    <span style="color: #dcaeea;">colors</span> <span style="color: #51afef;">=</span> {d: palette[i <span style="color: #51afef;">%</span> <span style="color: #c678dd;">len</span>(palette)] <span style="color: #51afef;">for</span> i, d <span style="color: #51afef;">in</span> <span style="color: #c678dd;">enumerate</span>(devices)}

    <span style="color: #dcaeea;">fig</span> <span style="color: #51afef;">=</span> go.Figure()
    <span style="color: #dcaeea;">rng</span> <span style="color: #51afef;">=</span> np.random.default_rng(123)

    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">semantic order: data &#8594; box &#8594; KDE
</span>    <span style="color: #dcaeea;">DATA_OFFSET</span> <span style="color: #51afef;">=</span> <span style="color: #51afef;">-</span>0.20
    <span style="color: #dcaeea;">BOX_OFFSET</span>  <span style="color: #51afef;">=</span>  0.00
    <span style="color: #dcaeea;">KDE_OFFSET</span>  <span style="color: #51afef;">=</span> <span style="color: #51afef;">+</span>0.15

    <span style="color: #51afef;">for</span> d <span style="color: #51afef;">in</span> devices:
        <span style="color: #dcaeea;">y</span> <span style="color: #51afef;">=</span> plot_df.loc[plot_df[GROUP_COL] <span style="color: #51afef;">==</span> d, value_col].to_numpy()
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">len</span>(y) <span style="color: #51afef;">==</span> 0:
            <span style="color: #51afef;">continue</span>

        <span style="color: #dcaeea;">y_ds</span> <span style="color: #51afef;">=</span> downsample(y, max_points, rng)
        <span style="color: #dcaeea;">x0</span> <span style="color: #51afef;">=</span> x_map[d]
        <span style="color: #dcaeea;">col</span> <span style="color: #51afef;">=</span> colors[d]

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">raw data
</span>        fig.add_trace(
            go.Scatter(
                x<span style="color: #51afef;">=</span>x0 <span style="color: #51afef;">+</span> DATA_OFFSET <span style="color: #51afef;">+</span> rng.uniform(<span style="color: #51afef;">-</span>x_spread, x_spread, size<span style="color: #51afef;">=</span><span style="color: #c678dd;">len</span>(y_ds)),
                y<span style="color: #51afef;">=</span>y_ds,
                mode<span style="color: #51afef;">=</span><span style="color: #98be65;">"markers"</span>,
                marker<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(
                    size<span style="color: #51afef;">=</span>4,
                    color<span style="color: #51afef;">=</span>to_rgba(col, 0.55),
                    line<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(width<span style="color: #51afef;">=</span>0.3, color<span style="color: #51afef;">=</span>to_rgba(col, 0.85)),
                ),
                showlegend<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>,
            )
        )

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">box plot (narrow, reference)
</span>        fig.add_trace(
            go.Box(
                x<span style="color: #51afef;">=</span>np.full(<span style="color: #c678dd;">len</span>(y_ds), x0 <span style="color: #51afef;">+</span> BOX_OFFSET),
                y<span style="color: #51afef;">=</span>y_ds,
                width<span style="color: #51afef;">=</span>0.15,
                boxpoints<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>,
                quartilemethod<span style="color: #51afef;">=</span><span style="color: #98be65;">"linear"</span>,
                line<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(color<span style="color: #51afef;">=</span>col, width<span style="color: #51afef;">=</span>1.4),
                fillcolor<span style="color: #51afef;">=</span>to_rgba(col, 0.18),
                marker_color<span style="color: #51afef;">=</span>col,
                showlegend<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>,
            )
        )

        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">KDE (from downsample only)
</span>        fig.add_trace(
            go.Violin(
                x<span style="color: #51afef;">=</span>np.full(<span style="color: #c678dd;">len</span>(y_ds), x0 <span style="color: #51afef;">+</span> KDE_OFFSET),
                y<span style="color: #51afef;">=</span>y_ds,
                side<span style="color: #51afef;">=</span><span style="color: #98be65;">"positive"</span>,
                width<span style="color: #51afef;">=</span>0.55,
                scalegroup<span style="color: #51afef;">=</span><span style="color: #98be65;">"all"</span>,
                points<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>,
                spanmode<span style="color: #51afef;">=</span><span style="color: #98be65;">"hard"</span>,
                line<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(color<span style="color: #51afef;">=</span>col, width<span style="color: #51afef;">=</span>1.2),
                fillcolor<span style="color: #51afef;">=</span>to_rgba(col, 0.35),
                showlegend<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>,
            )
        )

    fig.update_layout(
        height<span style="color: #51afef;">=</span>fig_height,
        violingap<span style="color: #51afef;">=</span>0,
        violinmode<span style="color: #51afef;">=</span><span style="color: #98be65;">"overlay"</span>,
        boxmode<span style="color: #51afef;">=</span><span style="color: #98be65;">"overlay"</span>,
        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">title=dict(
</span>        <span style="color: #5B6268;">#     </span><span style="color: #5B6268;">text=f"{value_col} by device_id",
</span>        <span style="color: #5B6268;">#     </span><span style="color: #5B6268;">x=0.01,
</span>        <span style="color: #5B6268;">#     </span><span style="color: #5B6268;">xanchor="left",
</span>        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">),
</span>        xaxis<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(
            title<span style="color: #51afef;">=</span><span style="color: #98be65;">"device_id"</span>,
            tickmode<span style="color: #51afef;">=</span><span style="color: #98be65;">"array"</span>,
            tickvals<span style="color: #51afef;">=</span>xs.tolist(),
            ticktext<span style="color: #51afef;">=</span>[<span style="color: #c678dd;">str</span>(d) <span style="color: #51afef;">for</span> d <span style="color: #51afef;">in</span> devices],
            <span style="color: #c678dd;">range</span><span style="color: #51afef;">=</span>[<span style="color: #51afef;">-</span>0.9, <span style="color: #c678dd;">len</span>(devices) <span style="color: #51afef;">-</span> 0.1],
            showgrid<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>,
        ),
        yaxis<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(
            title<span style="color: #51afef;">=</span>value_col,
            showgrid<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>,
        ),
    )

    <span style="color: #51afef;">return</span> fig


</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><code>
</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #51afef;">def</span> <span style="color: #c678dd;">marginal_cdf_plot</span>(df, feature, group_col):
    <span style="color: #dcaeea;">cmap</span> <span style="color: #51afef;">=</span> build_color_map(df, group_col)
    <span style="color: #dcaeea;">fig</span> <span style="color: #51afef;">=</span> go.Figure()

    <span style="color: #51afef;">for</span> g, sub <span style="color: #51afef;">in</span> df.groupby(group_col):
        <span style="color: #dcaeea;">vals</span> <span style="color: #51afef;">=</span> np.sort(sub[feature].dropna().to_numpy())
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">len</span>(vals) <span style="color: #51afef;">==</span> 0:
            <span style="color: #51afef;">continue</span>

        <span style="color: #dcaeea;">cdf</span> <span style="color: #51afef;">=</span> np.arange(1, <span style="color: #c678dd;">len</span>(vals) <span style="color: #51afef;">+</span> 1) <span style="color: #51afef;">/</span> <span style="color: #c678dd;">len</span>(vals)

        fig.add_trace(
            go.Scatter(
                x<span style="color: #51afef;">=</span>vals,
                y<span style="color: #51afef;">=</span>cdf,
                mode<span style="color: #51afef;">=</span><span style="color: #98be65;">"lines"</span>,
                line_shape<span style="color: #51afef;">=</span><span style="color: #98be65;">"hv"</span>,
                line_width<span style="color: #51afef;">=</span>2,
                name<span style="color: #51afef;">=</span><span style="color: #c678dd;">str</span>(g),
                marker_color<span style="color: #51afef;">=</span>cmap[g],
                hovertemplate<span style="color: #51afef;">=</span>(
                    f<span style="color: #98be65;">"</span>{group_col}<span style="color: #98be65;">: </span>{g}<span style="color: #98be65;">&lt;br&gt;"</span>
                    f<span style="color: #98be65;">"</span>{feature}<span style="color: #98be65;">: %{{x:.2f}}&lt;br&gt;"</span>
                    f<span style="color: #98be65;">"CDF: %{{y:.3f}}"</span>
                ),
            )
        )

    fig.update_xaxes(showline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>, linewidth<span style="color: #51afef;">=</span>2, zeroline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>)
    fig.update_yaxes(showline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>, linewidth<span style="color: #51afef;">=</span>2, zeroline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>)

    fig.update_layout(
        height<span style="color: #51afef;">=</span>420,
        margin<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(l<span style="color: #51afef;">=</span>60, r<span style="color: #51afef;">=</span>30, t<span style="color: #51afef;">=</span>60, b<span style="color: #51afef;">=</span>50),
        legend<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(
            orientation<span style="color: #51afef;">=</span><span style="color: #98be65;">"h"</span>,
            yanchor<span style="color: #51afef;">=</span><span style="color: #98be65;">"bottom"</span>,
            y<span style="color: #51afef;">=-</span>0.25,
            xanchor<span style="color: #51afef;">=</span><span style="color: #98be65;">"center"</span>,
            x<span style="color: #51afef;">=</span>0.5,
        ),
    )

    <span style="color: #51afef;">return</span> fig


</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #51afef;">def</span> <span style="color: #c678dd;">feature_vs_distance_plot</span>(df, feature, group_col, dist_col<span style="color: #51afef;">=</span><span style="color: #98be65;">"distance"</span>):
    <span style="color: #dcaeea;">cmap</span> <span style="color: #51afef;">=</span> build_color_map(df, group_col)
    <span style="color: #dcaeea;">fig</span> <span style="color: #51afef;">=</span> go.Figure()

    <span style="color: #51afef;">for</span> g, sub <span style="color: #51afef;">in</span> df.groupby(group_col):
        fig.add_trace(
            go.Scatter(
                x<span style="color: #51afef;">=</span>sub[dist_col],
                y<span style="color: #51afef;">=</span>sub[feature],
                mode<span style="color: #51afef;">=</span><span style="color: #98be65;">"markers"</span>,
                marker<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(size<span style="color: #51afef;">=</span>5, opacity<span style="color: #51afef;">=</span>0.7, color<span style="color: #51afef;">=</span>cmap[g]),
                name<span style="color: #51afef;">=</span><span style="color: #c678dd;">str</span>(g),
                hovertemplate<span style="color: #51afef;">=</span>(
                    f<span style="color: #98be65;">"</span>{group_col}<span style="color: #98be65;">: </span>{g}<span style="color: #98be65;">&lt;br&gt;"</span>
                    f<span style="color: #98be65;">"</span>{dist_col}<span style="color: #98be65;">: %{{x:.1f}}&lt;br&gt;"</span>
                    f<span style="color: #98be65;">"</span>{feature}<span style="color: #98be65;">: %{{y:.2f}}"</span>
                ),
            )
        )

    fig.update_xaxes(
        title<span style="color: #51afef;">=</span><span style="color: #98be65;">"distance [m]"</span>,
        showline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>,
        linewidth<span style="color: #51afef;">=</span>2,
        zeroline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>,
    )
    fig.update_yaxes(
        title<span style="color: #51afef;">=</span>feature,
        showline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>,
        linewidth<span style="color: #51afef;">=</span>2,
        zeroline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>,
    )

    fig.update_layout(
        height<span style="color: #51afef;">=</span>420,
        margin<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(l<span style="color: #51afef;">=</span>60, r<span style="color: #51afef;">=</span>30, t<span style="color: #51afef;">=</span>60, b<span style="color: #51afef;">=</span>50),
        legend<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(
            orientation<span style="color: #51afef;">=</span><span style="color: #98be65;">"h"</span>,
            yanchor<span style="color: #51afef;">=</span><span style="color: #98be65;">"bottom"</span>,
            y<span style="color: #51afef;">=-</span>0.25,
            xanchor<span style="color: #51afef;">=</span><span style="color: #98be65;">"center"</span>,
            x<span style="color: #51afef;">=</span>0.5,
        ),
    )

    <span style="color: #51afef;">return</span> fig


</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #51afef;">def</span> <span style="color: #c678dd;">feature_vs_time_plot</span>(df, feature, group_col, time_col<span style="color: #51afef;">=</span><span style="color: #98be65;">"timestamp"</span>):
    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">ensure datetime conversion (non-destructive)
</span>    <span style="color: #dcaeea;">t</span> <span style="color: #51afef;">=</span> pd.to_datetime(df[time_col], errors<span style="color: #51afef;">=</span><span style="color: #98be65;">"coerce"</span>)
    <span style="color: #dcaeea;">dff</span> <span style="color: #51afef;">=</span> df.copy()
    <span style="color: #dcaeea;">dff</span>[time_col] <span style="color: #51afef;">=</span> t

    <span style="color: #dcaeea;">cmap</span> <span style="color: #51afef;">=</span> build_color_map(dff, group_col)
    <span style="color: #dcaeea;">fig</span> <span style="color: #51afef;">=</span> go.Figure()

    <span style="color: #51afef;">for</span> g, sub <span style="color: #51afef;">in</span> dff.groupby(group_col):
        fig.add_trace(
            go.Scatter(
                x<span style="color: #51afef;">=</span>sub[time_col],
                y<span style="color: #51afef;">=</span>sub[feature],
                mode<span style="color: #51afef;">=</span><span style="color: #98be65;">"markers"</span>,
                marker<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(
                    size<span style="color: #51afef;">=</span>4,
                    opacity<span style="color: #51afef;">=</span>0.6,
                    color<span style="color: #51afef;">=</span>cmap[g],
                ),
                name<span style="color: #51afef;">=</span><span style="color: #c678dd;">str</span>(g),
                hovertemplate<span style="color: #51afef;">=</span>(
                    f<span style="color: #98be65;">"</span>{group_col}<span style="color: #98be65;">: </span>{g}<span style="color: #98be65;">&lt;br&gt;"</span>
                    f<span style="color: #98be65;">"time: %{{x|%Y-%m-%d %H:%M:%S}}&lt;br&gt;"</span>
                    f<span style="color: #98be65;">"</span>{feature}<span style="color: #98be65;">: %{{y:.2f}}"</span>
                ),
            )
        )

    fig.update_xaxes(
        title<span style="color: #51afef;">=</span><span style="color: #98be65;">"time"</span>,
        showline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>,
        linewidth<span style="color: #51afef;">=</span>2,
        zeroline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>,
    )
    fig.update_yaxes(
        title<span style="color: #51afef;">=</span>feature,
        showline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>,
        linewidth<span style="color: #51afef;">=</span>2,
        zeroline<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">False</span>,
    )

    fig.update_layout(
        height<span style="color: #51afef;">=</span>420,
        margin<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(l<span style="color: #51afef;">=</span>60, r<span style="color: #51afef;">=</span>30, t<span style="color: #51afef;">=</span>60, b<span style="color: #51afef;">=</span>50),
        legend<span style="color: #51afef;">=</span><span style="color: #c678dd;">dict</span>(
            orientation<span style="color: #51afef;">=</span><span style="color: #98be65;">"h"</span>,
            yanchor<span style="color: #51afef;">=</span><span style="color: #98be65;">"bottom"</span>,
            y<span style="color: #51afef;">=-</span>0.25,
            xanchor<span style="color: #51afef;">=</span><span style="color: #98be65;">"center"</span>,
            x<span style="color: #51afef;">=</span>0.5,
        ),
    )

    <span style="color: #51afef;">return</span> fig
</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><code>


st.markdown(r<span style="color: #98be65;">'''
As described in the previous section, we define the training set as the tuple

$$x = (t, \mathrm{id}, d, f, l_{\text{frame}}, \mathrm{RSSI}, \mathrm{SNR}, \mathrm{ToA}, \mathrm{SF})$$

Here, one can explore every selected feature, its per-device distribution, and dependence on two key varaibles -- relative distance and time.

'''</span>)

st.markdown(r<span style="color: #98be65;">'''
### Raincloud plots
One of the best way to decribe 
'''</span>)


<span style="color: #dcaeea;">fig</span> <span style="color: #51afef;">=</span> raincloud_plot(df)
st.plotly_chart(fig, use_container_width<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>)

st.markdown(r<span style="color: #98be65;">'''
Let $\mathbf{X}=(X_1,\dots,X_d)$ be a random vector. The *marginal* CDF of component $X_i$ is

$$
F_{X_i}(x) \, = \, \mathrm{P}(X_i \le x).
$$

In some sense it is the CDF of $X_i$ alone, i.e. the joint distribution with all other coordinates &#8220;ignored&#8221;.
'''</span>)

st.plotly_chart(
    marginal_cdf_plot(df, value_col, GROUP_COL),
    use_container_width<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>,
)


st.plotly_chart(
    feature_vs_distance_plot(df, value_col, GROUP_COL),
    use_container_width<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>,

)


st.plotly_chart(
    feature_vs_time_plot(df, value_col, GROUP_COL),
    use_container_width<span style="color: #51afef;">=</span><span style="color: #a9a1e1;">True</span>,
)

</code></pre>
</div>
</div>
</div>
</div>
</body>
</html>
